---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotModifyLinkedFile
source: html/4637d266-f732-a072-a795-d3a71cd304e9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotModifyLinkedFile Property

Shared Sites in the link ""%1!s!"" cannot be modified.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotModifyLinkedFile { get; }
```